[Language]
Code="uk"
Name="Українська"
Translator="Andrii Krokhmalnyi <andriy.krokh@gmail.com>"
Dir="ltr"

[MainFrame]
Title="Lingoes"
Close="Закрити"
Maximize="Розгорнути"
Minimize="Згорнути"
Restore="Відновити"
Menu="головне меню"

; Status Icon
[NotifyIcon]
Tip="Перекладач Lingoes\nПереклад під курсором: [$CursorStatus]\nПереклад виділеного: [$SelectionStatus]\nПереклад буфера обміну: [$ClipboardStatus]"
InfoTitle="Lingoes Translator"
Info="Переклад під курсором: [$CursorStatus]\nПереклад виділеного: [$SelectionStatus]\nПереклад буфера обміну: [$ClipboardStatus]"
Enabled="Увімкнений"
Disabled="Вимкнений"

[MainMenu]
Open="Відкрити"
CursorTranslator="Переклад під курсором"
SelectionTranslator="Переклад виділеного"
ClipboardTranslator="Переклад буфера обміну"
Configuration="Налаштування..."
Dictionaries="Словники..."
Appendices="Додатки..."
Activation="Активація програми"
UpdateOnline="Online-оновлення"
Help="Допомога"
About="Про програму "Lingoes""
SupportOnline="Технічна підтримка Online"
Exit="Вихід"

[DlgInput]
Back="Назад"
Forward="Вперед"
MainMenu="головне меню"
HistoryList="Список попередніх дій"
Search="Пошук", "Знайти детальне пояснення"
WebSearch="Веб-пошук"
AutoMatch="Auto Match", "Auto Match At Index Group"
MatchSetup="Index Group Option..."
FindEngine="Get more web engines..."

[DlgIndex]
Index="Індекс"
Guide="Опції"
Appendix="Додатки"
NoIndex="Без індексу"
AddIndexGroup="<div style=\"margin: 10; font-family: '[$TextFont]'; font-size: [$TextFontSize]pt\">Додати словник до <b>Index Group</b>, Під час введення слова, ви можете отримувати варіанти написання.<br/><br/><a href=\"app://dictionary_group/[$IndexGroupID]\"><u>Щоби організувати індексну групу, клацніть тут.</u></a></div>"

[WebGuide]
Results="Результати"
Spelling="Варіанти вимови"
Appendices="Додатки"
Options="Опції"
Dictionaries="Словники...", "Керування словниками"
ManageAppendices="Додатки...", "Керування додатками"
Configuration="Конфігурація...", "Відкрити вкладку конфігурації"
Help="Допомога", "Відкрити довідку по Lingoes"
Homepage="lingoes.net", "Відвідати сайт Lingoes"
Community="Спільнота Lingoes", "Lingoes онлайн спільнота"

[DlgAppendix]
WndTitle="Керування додатками"
Close="Закрити"
Install="Встановити", "Додатки Lingoes (*.laf)|*.laf|", "Встановлення невдале! \nМожливо тому, що у Вас немає відповідних прав доступу."
Delete="Вилучити", "Ви впевнені, що бажаєте вилучити \"[$Title]\"", "Видалення \"[$Title]\" невдале! \nМожливо тому, що у Вас немає відповідних прав доступу."
Modify="Змінити", "Зміна невдала! \nМожливо тому, що у Вас немає відповідних прав доступу."
NewGroup="Нова група", "Не вдалось створити групу! \nМожливо тому, що у Вас немає відповідних прав доступу."
MoveUp="Вверх"
MoveDown="Вниз"
CreateAppendix="Створити додаток..."
Download="Більше додатків..."
Name="Назва"
Group="Група"
InstallSucceed="\"[$Title]\" Встановлення успішне."
OverwriteInstall="Додаток існує, перезаписати його?\n\nЗаголовок:[$Title]\nНазва: [$Name]"
InvalidInstallFile="Невірний інсталяційний файл!\n[$Filename]"

[DlgAppendixEdit]
WndTitle="Змінити \"[$Title]\"", "Створити нову групу"
Name="Назва"
DisplayTitle="Заголовок"
DisplayStyle="Стиль"
Ok="Гаразд"
Cancel="Відміна"

[DlgAppendixBuilder]
WndTitle="Новий додаток"
Name="Назва:  (тільки a-z, 0-9, дефіс і підкреслення)", "Назва є обов'язковою, доступні лише a-z, 0-9, дефіс і підреслення."
Title="Заголовок:", "Заголовок є обов'язковим!"
Location="Папка проекту:", "Не вдалось створити папку проекту!", "Оберіть доступну папку, будь-ласка"
Create="Створити новий проект", "Проект успішно створений!\n\nNow you can design the appendix freely by editing the \"index.html\" file.", "Не вдалось створити проект!"
Build="Побудувати", "Файл додатка успішно створений!\n[$Filename]", "Не вдалось створити файл додатка!\n[$Filename]"
Close="Закрити"
Tips="Підказка: Ви можете зробити дизайн додатку просто відредагувавши файл \"index.html\" після створення проекту."
OverwriteProject="Файл проекту існує, перезаписати його?"

[DlgView]
Speak="Вимовити", "Вимовити вибраний текст"
Search="Пошук"
Copy="Копіювати"
Print="Друк..."
Save="Зберегти..."
Find="Знайти..."
SelectAll="Виділити все"
TextTranslate="Переклад", "Запустити переклад тексту"
StartPage="", "Початкова сторінка"
ShowIndex="Відобразити бокову панель"
HideIndex="Приховати бокову панель"
SaveFilter="HTML файл (*.htm; *.html)|*.htm;*.html|"
SpeechOption="Налаштування вимови..."
SelectVoice="Обрати тип голосу"
Activation="Активація", "Помічник активації Lingoes"

[DlgRegister]
Title="Lingoes - Реєстрація комерційного користувача"
FreeDownload="Lingoes безкоштовний для некомерційного використання.\r\nЗавантажити безкоштовну версію..."
Name="Реєстраційне ім'я:", "Реєстраційне ім'я є обов'язковим"
Email="Реєстраційний e-mail:", "Реєстраційний e-mail є обов'язковим"
RegCode="Реєстраційний код:", "Реєстраційний код невірний"
Support="Підтримка"
Register="Зареєструватись", "Не вдалось зберегти реєстраційну інформацію"
Exit="Вихід"

[DlgInfo]
Title="Повідомлення"
Ok="Гаразд"
Cancel="Відміна"
Yes="Так"
No="Ні"
Retry="Повторити"
Abort="Припинити"
Ignore="Ігнорувати"

[DlgAuthentication]
Title="З'єднатись з "
TitleProxy="З'єднання з проксі сервером "
Username="Логін:"
Password="Пароль:"
Remember="Запам'ятати пароль"
Ok="Гаразд"
Cancel="Відміна"

[WndGrab]
Open="Пошук детальних пояснень"
Speak="Вимовити"
Copy="Скопіювати"
TextTranslation="Переклад тексту"
KeepSize="Зберегти розмір вікна"
KeepVisible="Завжди бути поверх інших вікон"
Back="Назад"
Forward="Вперед"
Search="Пошук\n  Enter:\t\tПошук\n  Ctrl + Enter:\tПошук детальних пояснень\n  Shift + Enter:\tПереклад тексту\n  Alt + Enter:\tВеб-пошук"
RollUp="Згорнути / розгорнути вікно"

[DlgDictOption]
Title="Керування словниками"
NetInstall="Встановити із сайту", "Встановити словник із сайту lingoes"
Install="Встановити", "Встановити словник з диску"
Uninstall="Вилучити", "Вилучити словник"
Add="Додати", "Додати словник у список"
Remove="Вилучити", "Вилучити словник із списку"
Download="Завантажити", "Завантажити цей словник для роботи без підключення до інтернету"
MoveTop="", "Перемістити на початок списку"
MoveUp="", "Перемістити вище"
MoveDown="", "Перемістити нижче"
MoveBottom="", "Перемістити в кінець списку"
MoreDetails="", "Довідка про словник"
Close="Закрити"

Installed="Встановлені словники"
Query="Встановлені словники"
Index="Індексна група"
Grab="Група перекладу під курсором"

InstalledList="Встановлені словники"
QueryList="Встановлені словники"
IndexList="Список індексної групи"
GrabList="Список групи перекладу під курсором"
DictID="ID"
Online="Онлайн"

Type="Тип"
OnlineType="Необхідна наявність інтернету"
AddFilter="Словники Lingoes (*.ld2, *.ldp)|*.ld2;*.ldp|"
InstallDict="Встановити словник"
Installing="Встановлюю..."
IndexDictTooMany="Підказка:\n\nДодавання великої кількості словників до \"Index Group\" знижує швидкість знаходження слів при введенні букв у вікні пошуку.\nТому ми рекомендуємо Вам додати  до \"Index Group\" тільки кілька словників, які часто використовуються."

[DlgDictList]
Title="Додати словники"
Add="Додати"
Cancel="Відмінити"
Select="Обрати"
DictList="Встановлені словники"
ID="ID"
Online="Онлайн"

[DlgDictInfo]
Title="Про словник"
Close="Гаразд"

ID="ID"
MD5="MD5"
Name="Назва"
Version="Версія"
Date="Дата створення"
Update="Останні зміни"
IndexCount="Кількість слів"
GlsCount="Всього словників"
DictTitle="Назва"
DictEdition="Видання"
DictDescription="Опис"
Language=Мова
PubAuthor="Автор"
PubEmail="Email"
PubWebsite="Сайт"
PubCopyright="Авторські права"
Filename="Ім'я файла"

; Install Dictionaries
[DlgDictInstall]
Title="Встановлення словника"
InstallSucceed="Встановлення словника \"[$DictTitle]\""
DictGroupOption="Налаштування"
AddIndexGroup="Додати до \"Індексної групи\""
AddIndexGroupDesc="Lingoes шукатиме у словниках індексної групи і видаватиме перший результат в індексній панелі під час набору тексту."
AddGrabGroup="Додати до \"Групи перекладу під курсором\""
AddGrabGroupDesc="Lingoes шукатиме у словниках групи перекладу під курсором і видаватиме результат у віконці біля курсора."
Ok="Гаразд"

; Configuration
[DlgOption]
Title="Налаштування"
Ok="Гаразд"
Cancel="Відмінити"
General="Загальні"
Appearance="Вигляд"
Connection="З'єднання"
Speech="Вимова"
Hotkey="Гарячі клавіші"
Translate="Переклад"
License="Ліцензія"
Capture="Захоплення тексту"

; General
[DlgOptGeneral]
Language="Мова"
UILanguage="Мова користувацького інтерфейсу"

WebSearch="Веб-пошук"
SelectWebSearch="Пошуковий двигун"

TermHistory="Історія слів"
SaveHistory="Кількість слів, які зберігає історія"
ClearHistory="Очистити історію"
ClearHistoryConfirmation="Ви впевнені, що бажаєте очистити історію?"

ResultCache="Локальний кеш онлайн словника"
ClearCache="Очистити кеш", "Ви впевнені, що бажаєте очистити кеш?"

AutoStart="Запускати програму при завантаженні Windows"
StartMin="Згорнути після завантаження"

; Appearance
[DlgOptAppearance]
UserInterface="Користувацький інтерфейс"
WindowStyle="Стиль вікон"
WindowFont="Шрифт тексту у вікнах"
WindowFontSize="Розмір шрифта"
WindowFontSizeList="7", "8", "9", "10", "10.5", "11"
ResultDisplay="Відображення результату"
TextFont="Шрифт тексту"
TextFontSize="Розмір шрифта"
TextFontSizeList="7", "8", "9", "10", "10.5", "11", "12", "13", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36", "48"
PhoneticFont="Фонетичний шрифт"
CursorTranslatorBar="Вікно перекладу під курсором"
FontColor="Колір шрифта"
BackColor="Колір фону"
BorderColor="Колір меж"
Transparence="Translucent Cursor Translator Windows"
SampleText="Переклад під курсором"

[Style]
0="Відсутній"
1="За замовчуванням"

; Translate
[DlgOptTranslate]
SupportLCMap="Підтримка відображення на місцеву мову"
InstantTranslation="Поточний переклад"
TargetLanguage="Мова призначення:"
CurrentUserLanguage="= Мова поточного користувача"
TargetLanguage2="Якщо мова призначення співпадає з мовою джерела, замінити її на:"
NoTranslate="= Без перекладу"

; Capture
[DlgOptCapture]
CursorActivation="Режим перекладу під курсором"
MouseActivation="Режим перекладу з використанням мишки:"
MouseOver="Наведення мишки на текст"
LeftMouseButton="Ліва кнопка мишки"
MiddleMouseButton="Середня кнопка мишки"
RightMouseButton="Права кнопка мишки"
MouseXButton1="Перша додаткова кнопка мишки"
MouseXButton2="Друга додаткова кнопка мишки"
TimeDelay="Затримка:"
MSEL="мілісекунд"
IgnoreNumber="Ігнорувати числа"
Language="Налаштування мови"
IgnoreLatin="Ігнорувати латинку (англійська, французька, німецька, іспанська, тощо)"
IgnoreCJK="Ігнорувати східно-азійські мови (китайська, японська, корейська)"
IgnoreCyrillic="Ігнорувати кирилицю (українська, російська, болгарська, тощо)"
IgnoreArabic="Ігнорувати арабську та іврит"
InstallAdobePlugin="Встановити плагін Adobe Acrobat/Reader"
ZonedWord="Перекладати виділений текст"
ForTextSelection="При виділенні тексту"
ForDoubleClicking="Подвійним клацанням мишкою"
ZonedWordFilterRule="Правила фільтрування виділеного тексту..."
ShowOnlyFirstResult="Видавати лише перший результат"

; Capture - Zoned Word Filter
[DlgOptTranslateZWFilter]
Title="Правила фільтрування виділеного тексту"
ProgramFilename="Назва програми", "Назва програми (залишіть порожнім, якщо для всіх)"
WndClassName="Тип вікна", "Тип вікна (залишіть порожнім, якщо для всіх)"
DisableSelect="Ігнорувати виділення тексту", "Ігнорувати виділення тексту"
DisableDBLClick="Ігнорувати подвійне клацання", "Ігнорувати подвійне клацання"
Comment="Примітка", "Примітка"
Add="Додати"
Modify="Змінити"
Delete="Вилучити", "Ви впевнені, що бажаєте вилучити цей об'єкт?"
Ok="Гаразд"
Cancel="Відміна"
LoadDefault="За замовчуванням", "Ви впевнені, що бажаєте встановити параметри за замовчуванням?"
Browser="...", "Браузер", "Програма (*.exe)|*.exe|"
Capture="...", "Захоплення типу вікна"
AllProgram="-- Всі програми --"
AllWindow="-- Всі вікна --"

[WndClassNameCapture]
Title="Захоплення типу вікна"
ProgramFilename="Назва програми"
WndClassName="Тип вікна"
Capture="Захопити з екрану"

; Speech
[DlgOptSpeech]
RPPEngine="Голосовий двигун Natural Voice"
RPPEnable="Дозволити"
RPPVoice="Голос"
RPPRebuildIndexFile="Згенерувати індексний файл", "Генерація індексного файла провалилась! \nМожливо тому, що у Вас немає відповідних прав доступу."
Engine="Голосовий двигун TTS"
Voice="Голос"
Enable="Дозволити"
Volume="Гучність"
Pitch="Тональність"
Speed="Швидкість"
Format="Формат", "За замовчуванням"
RealtimePron="Вимовляти відразу (в режимі реального часу)"
PronInQuery="При знаходженні слова"
PronInCapture="При захопленні тексту"
Test="Тест"
EnterText="Введіть текст і спробуйте звучання голосу"
DownloadTTS="Завантажити голосовий модуль Natural Voice і TTS..."

; Connect
[DlgOptConnection]
ConnectSet="Налаштування з'єднання"
DirectConnect="Пряме з'єднання"
IEProxyConnect="Використовувати налаштування проксі з вашого веб-браузера"
ProxyConnect="З'єднання за допомогою проксі-сервера / фаєрвола"
ProxyServer="Проксі сервер:"
ProxyPort="Порт:"
Username="Логін:"
Password="Пароль:"
OnlineUpdate="Online-оновлення"
UpdateNow="Оновити"
EnableUpdate="Увімкнути online-оновлення"

; Hotkey
[DlgOptHotkey]
OpenMainWnd="Відкрити головне вікно"
GrabToggleKey="Режим "Переклад під курсором""
SelectionToggleKey="Режим "Переклад виділеного""
ClipboardToggleKey="Режим "Переклад буфера обміну""
Pronounce="Вимова"
CopyInterpretation="Скопіювати перекладений текст"
SpeakSelectedText="Вимовити виділений текст"
StopSpeak="Зупинити вимову тексту"
DisableHotKey="Вимкнути гарячі клавіші"

[DlgExpire]
Title="Випробувальний період завершився"
Ok="Оновити"
Cancel="Відміна"
NetworkSettings="Мережеві налаштування"
Support="Lingoes.net"
AskUpgrade="Випробувальний період поточної версії програми завершився, вам необхідно оновити версію програми! \nОновити?"

[DlgAbout]
DlgTitle="Про програму "Lingoes""
Version="Версія: "
PortableEdition="Portable Edition"
Email="Email"
Website="Сайт програми"
LicenseTo="Програма зареєстрована на:"
LicenseID="ID: "

[WebResult]
SpellingAlternatives="Альтернативні вимови"
SpellChecker="Перевірка вимови"
TextTranslation="Переклад тексту"
WebSearch="Веб-пошук"
MoreResults="Більше результатів"
WaitSearch="Запитую результати пошуку..."
NoMatch="<div id='dict_result_nomatch' style=\"font-family:'[$TextFont]'; font-size:[$TextFontSize]pt; line-height:normal; padding:10; display:[$Display]\"><b>Не виявлено співпадінь для \"<font color='#C00000'>[$SearchKey]</font>\".</b></div>"

[WebStartPage]
StartPageTpl="<table id='startpage' width='100%' height='100%' border='0' cellspacing='0' cellpadding='10' onselectstart='return false'><tr><td align='center' style=\"font-family: '[$Font]'; font-size: [$FontSize]pt; line-height: 1.2em\"><a href='app://homepage/'><img border='0' src='[$ImgPath]logomain.png' width='134' height='40' style='margin-bottom:50'></a></td></tr></table>"
HelpTip="Як користуватись програмою Lingoes"
DownDictTip="Завантажити словники"
Intro="Підтримує переклад з/на більш ніж 80 мов<br>Переклад під курсором, Текстовий переклад & Озвучення тексту"

[TextTranslation]
Title="Переклад тексту"
To="To"
Translate="Перекласти"
RequestFailed="Не вдався запит до перекладацького сервісу."
ConnectFailed="Помилка з'єднання з сервером. Якщо Ви з'єднані з інтернетом, перевірте налаштування вашого з'єднання. "
WaitRequest="Запитую результати перекладу..."
ParseResultFailed="Проаналізуйте помилку перекладу. Якщо Ви отримаєте це повідомлення кілька раз, будь-ласка повідомте нам."

; Layout
[Layout]
DictMenu="Меню словника"
ShowResult="Показати результат"
MinimizeResult="Згорнути результат"
FindWord="Знайти: "

; Dictionary Menu
[DictMenu]
About="Про словник..."
Enable="Увімкнути"
Disable="Вимкнути"
DisableMsg="Словник вимкнений, результати показуватись не будуть!\nВи можете знову ввімкнути його в діалозі \"Словники\"."
MoveTop="Встановити першим у таблиці результатів"
ArrangeResults="Розмістити результати..."
IndexGroup="  (Індексна група)"
QueryGroup="  (Група запитів)"
GrabGroup="  (Група перекладу під курсором)"

[Update]
Title="Online-оновлення"
AskUpgrade="Виявлена новая версія. Оновитись?"
UpgradeNow="Виявлена новая версія. Необхідно оновитись до нової версії"
UpdateSuccess="Програма успішно оновлена!"
UpdateFail="Помилка оновлення!"
NoUpdate="Поточна версія є актуальною"

CheckUpdate="Перевірка оновлень..."
GetUpdateInfo="Отримання інформації про оновлення..."
DownUpdateData="Завантаження оновлень..."
ExecUpdate="Оновлення системи..."
GetUpgradeInfo="Отримання інформації про оновлення..."
DownUpgradeData="Завантаження оновлень..."
ExecUpgrade="Оновлення системи..."
NeedExitForUpgrade="Lingoes завершить роботу для остаточного оновлення"

[Message]
InitUpdateServerFail="Помилка при спробі ініціалізації сервісу автоматичного оновлення."
StartDictServerFail="Помилка при спробі запуску сервісу словників."

DictFileErr="Невірний формат файла!\n[$Filename]"
DictVersinTooOld="[$Filename]\nВерсія поточного словника ([$DictVer]) застаріла, будь-ласка оновіть його.\n\nПерейти на сайт програми для пошуку останньої версії словника?"
DictVersinTooNew="[$Filename]\nВерсія словника ([$DictVer]) вимагає старішої версії програми.\n\nЗавантажити із сайту останню версію програми?"

AskDictRepeatInstall="Список словників містить словник \"[$DictTitle]\",\nПродовжити?"
InstallDictFail="Помилка при спробі встановити словник:\n[$Filename]"
AskUninstall="Ви впевнені, що бажаєте вилучити словник?\n\n[$DictTitle]\nID: [$DictID]"
UninstallDictFail="Помилка при спробі вилучити словник\n\n[$DictTitle]\nID: [$DictID]"
AskRemoveFromGroup="Ви впевнені, що бажаєте вилучити словник \"[$DictTitle]\" зі списку?"

MemoryAllocFail="Помилка звернення до пам'яті."
FilenameInvalid="Невірне ім'я файла."
SaveFileFail="Невдале збереження файлу"
OpenFileFail="Невдале відкриття файлу"

AreYouAbort="Ви впевнені, що бажаєте відмінити поточний процес?"
CreateThreadFail="Failed to create thread"
CreateEventFail="Failed to create event hand"
Unfulfilment="Ця опція не реалізована"
OnlyProVersion="Ця опція тільки для ПРО версії."
NoRegister="Це незареєстрована версія, зареєструйте програму щоб скористатись цією опцією."
UsernameIsEmpty="Немає імені користувача, будь-ласка введіть його знову."
SaveSearchResultFail="Помилка при спробі зберегти результати пошуку."

OpenAppendixFail="Failure to open appendix content."
OpenSpeechEngineFail="Помилка при завантаженні голосового двигуна, перевірте чи встановлений голосовой двигун у системі! \n\nВи повинні встановити голосовий двигун для вашої операційної системи щоб увімкнути опцію вимови слів. Якщо голосовий двигун не встановлений, Ви можете завантажити і встановити його із сайту програми \n\nЗавантажити двигун негайно?"

; NeedIE6Support="Lingoes needs Internet Explorer 6+, please update your web browser to IE6+"
NoImplement="Вибачте, опція не реалізована"